# Используем официальный образ Golang в качестве базового для сборки приложения
FROM golang:latest AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем содержимое текущей директории (где находится Dockerfile) внутрь контейнера в директорию /app
COPY . .

# Собираем приложение
RUN CGO_ENABLED=0 GOOS=linux go build -o cmd/main cmd/main.go

# Используем минимальный образ Ubuntu для финального контейнера
FROM ubuntu:latest

# Метаданные об авторах
LABEL authors="antonsotnik"

# Копируем собранное приложение из предыдущего этапа
COPY --from=builder /app /app

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Команда для запуска приложения при старте контейнера
CMD ["sh", "-c", "cd cmd && ./main"]